jmeter/login_to_main_offer_screen.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Login to main offer screen" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Login to main offer screen" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">100</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="project service - get all active projects" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">staging.ampnet.io</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/project/public/project/active?coop=ampnet</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="wallet service - get user wallet" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">staging.ampnet.io</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/wallet/wallet</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Auth token" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiJ9.eyJzdWIiOiJzdGFnaW5nYWRtaW5AYW1wbmV0LmlvIiwidXNlciI6IntcInV1aWRcIjpcIjg2Mjg2MzMyLTdiNDEtNDJjYi1iNTViLWU5NTA1ZDU5ZmNhY1wiLFwiZW1haWxcIjpcInN0YWdpbmdhZG1pbkBhbXBuZXQuaW9cIixcIm5hbWVcIjpcIlN0YWdpbmcgQWRtaW5cIixcImF1dGhvcml0aWVzXCI6W1wiTU9OSVRPUklOR1wiLFwiUFJBX1BST0ZJTEVcIixcIlBXQV9QUk9GSUxFXCIsXCJQUk9fUFJPRklMRVwiLFwiUFdPX1BST0ZJTEVcIixcIlBSQV9PUkdcIixcIlBXQV9PUkdfQVBQUk9WRVwiLFwiUFJPX09SR19JTlZJVEVcIixcIlBXT19PUkdfSU5WSVRFXCIsXCJQUkFfV0FMTEVUXCIsXCJQV0FfV0FMTEVUXCIsXCJQV0FfV0FMTEVUX1RSQU5TRkVSXCIsXCJQUkFfV0lUSERSQVdcIixcIlBXQV9XSVRIRFJBV1wiLFwiUFJBX0RFUE9TSVRcIixcIlBXQV9ERVBPU0lUXCIsXCJQV0FfQ09PUFwiLFwiUFJBX0NPT1BcIixcIlJPTEVfQURNSU5cIl0sXCJlbmFibGVkXCI6dHJ1ZSxcInZlcmlmaWVkXCI6dHJ1ZSxcImNvb3BcIjpcImFtcG5ldFwifSIsImlhdCI6MTYwODA1NzEyNiwiZXhwIjoxNjE1ODMzMTI2fQ.dpvsgP1Eip8MbN4Q-vrGYc5Pu35yeQSBhxVoE7Yov6ckOi9tER-qrHF77maeH5vEZQ0O-Ej1Tz2OVc0u5VpeiGHcZvjm3gasWsKsTn8QzatrATGqa4RfN4JOK9oju0anhuiOQmaNylibwo5zWuBT4zjasBygX6Wtqyf34EctJfxleK8GUzdNqxZiE34V0me7QG-1Yhf9Ie3IigdeKcBD25M46ULB_Gkb2cbmBrQd5mxyn1nCxh3T00axxAVi_qqOE719DdlA-qyUj9QIxCQCz1c_xT8u2iZ9FKAF2wo_4n6yotRHqGkJQwFBwPEig97SJhuYMDi7KnlnQ7w5zTWK3g</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
              </elementProp>
              <elementProp name="" elementType="Header">
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="user service - get own profile" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">staging.ampnet.io</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/user/me</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Auth token" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiJ9.eyJzdWIiOiJzdGFnaW5nYWRtaW5AYW1wbmV0LmlvIiwidXNlciI6IntcInV1aWRcIjpcIjg2Mjg2MzMyLTdiNDEtNDJjYi1iNTViLWU5NTA1ZDU5ZmNhY1wiLFwiZW1haWxcIjpcInN0YWdpbmdhZG1pbkBhbXBuZXQuaW9cIixcIm5hbWVcIjpcIlN0YWdpbmcgQWRtaW5cIixcImF1dGhvcml0aWVzXCI6W1wiTU9OSVRPUklOR1wiLFwiUFJBX1BST0ZJTEVcIixcIlBXQV9QUk9GSUxFXCIsXCJQUk9fUFJPRklMRVwiLFwiUFdPX1BST0ZJTEVcIixcIlBSQV9PUkdcIixcIlBXQV9PUkdfQVBQUk9WRVwiLFwiUFJPX09SR19JTlZJVEVcIixcIlBXT19PUkdfSU5WSVRFXCIsXCJQUkFfV0FMTEVUXCIsXCJQV0FfV0FMTEVUXCIsXCJQV0FfV0FMTEVUX1RSQU5TRkVSXCIsXCJQUkFfV0lUSERSQVdcIixcIlBXQV9XSVRIRFJBV1wiLFwiUFJBX0RFUE9TSVRcIixcIlBXQV9ERVBPU0lUXCIsXCJQV0FfQ09PUFwiLFwiUFJBX0NPT1BcIixcIlJPTEVfQURNSU5cIl0sXCJlbmFibGVkXCI6dHJ1ZSxcInZlcmlmaWVkXCI6dHJ1ZSxcImNvb3BcIjpcImFtcG5ldFwifSIsImlhdCI6MTYwODA1NzEyNiwiZXhwIjoxNjE1ODMzMTI2fQ.dpvsgP1Eip8MbN4Q-vrGYc5Pu35yeQSBhxVoE7Yov6ckOi9tER-qrHF77maeH5vEZQ0O-Ej1Tz2OVc0u5VpeiGHcZvjm3gasWsKsTn8QzatrATGqa4RfN4JOK9oju0anhuiOQmaNylibwo5zWuBT4zjasBygX6Wtqyf34EctJfxleK8GUzdNqxZiE34V0me7QG-1Yhf9Ie3IigdeKcBD25M46ULB_Gkb2cbmBrQd5mxyn1nCxh3T00axxAVi_qqOE719DdlA-qyUj9QIxCQCz1c_xT8u2iZ9FKAF2wo_4n6yotRHqGkJQwFBwPEig97SJhuYMDi7KnlnQ7w5zTWK3g</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
              </elementProp>
              <elementProp name="" elementType="Header">
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="middleware - project 1 " enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">staging.ampnet.io</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/middleware/projects/th_vo4XFmZe63zSWwsM96zJSZBbrKcdcLcaUcYVUpx36a7vDPbHR</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="middleware - project 2" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">staging.ampnet.io</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/middleware/projects/th_2JbHZNjGXJC8W4xSNaAzNofZgYM3incNedLuroFrwhYn2C3XGn</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="middleware - project 3" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">staging.ampnet.io</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/middleware/projects/th_27eAFugzQzdmeY2N6qcKv549osGhK6B2KNkBEmsdgHPEDSu7DW</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="middleware - project 4" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">staging.ampnet.io</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/middleware/projects/th_2fTzgcPAWSziarYCAqrRTT8hu7tSZ2BqfNV2KxNRxhEghUiNGs</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="middleware - project 5" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">staging.ampnet.io</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/middleware/projects/th_jy8Zsbfi8tzqGZC9SdZMCsDXsvL7Dj5KP3fvXQ9me2edMa54F</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>